Enums/упТипыРемонтов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыРемонтов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаменаШин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажОборудования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажПрицепов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлановоеТО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ремонт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упТипыРемонтов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Ложь
		Или Не ПолучитьФункциональнуюОпцию("упИспользуетсяУчетДополнительногоОборудования") 
		Или Не ПолучитьФункциональнуюОпцию("упИспользуетсяУчетШинУзловИАгрегатов") Тогда 
		СтандартнаяОбработка = Ложь;
		
		СписокИсключений = Новый СписокЗначений;
		Если Не ПолучитьФункциональнуюОпцию("упИспользуетсяУчетДополнительногоОборудования") Тогда
			СписокИсключений.Добавить(Перечисления.упТипыРемонтов.МонтажОборудования);
		КонецЕсли;
		Если Не ПолучитьФункциональнуюОпцию("упИспользуетсяУчетШинУзловИАгрегатов") Тогда
			СписокИсключений.Добавить(Перечисления.упТипыРемонтов.ЗаменаШин);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	упТипыРемонтов.Ссылка
		|ИЗ
		|	Перечисление.упТипыРемонтов КАК упТипыРемонтов
		|ГДЕ
		|	НЕ упТипыРемонтов.Ссылка В (&СписокИсключений)
		|
		|УПОРЯДОЧИТЬ ПО
		|	упТипыРемонтов.Порядок";
		Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
		
		ДанныеВыбора = Новый СписокЗначений;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			ДанныеВыбора.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти
